In [2]:
import pandas as pd
import numpy as np
import maplotlib.pyplot as plt

ModuleNotFoundError: No module named 'maplotlib'

In [3]:
from sqlalchemy import create_engine

In [4]:
engine = create_engine('postgres://postgres:jbm713177@localhost:5432/Employee_DB')
conn = engine.connect()

### Creating a bar chart of average salary by title

In [5]:
# All records in salaries table
salaries_df = pd.read_sql("SELECT * FROM salaries", conn)
salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [6]:
# All records in titles table
titles_df = pd.read_sql("SELECT * FROM titles", conn)
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [7]:
# Combine dataframes
combined_df = pd.merge(salaries_df, titles_df, on="emp_no", how="inner")
combined_df.head()

,emp_no,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,65828,1996-08-03,1997-08-03,Staff,1996-08-03,9999-01-01
2,10003,40006,1995-12-03,1996-12-02,Senior Engineer,1995-12-03,9999-01-01
3,10004,40054,1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,40054,1986-12-01,1987-12-01,Senior Engineer,1995-12-01,9999-01-01

In [21]:
# Find mean of salary by job title
grouped_df = combined_df.groupby("title").mean()
middle_df = grouped_df.drop(columns = "emp_no")
revised_data = middle_df.reset_index()
revised_data

                title        salary
0  Assistant Engineer  48493.204786
1            Engineer  48539.781423
2             Manager  51531.041667
3     Senior Engineer  48506.751806
4        Senior Staff  58503.286614
5               Staff  58465.271904
6    Technique Leader  48580.505772